app/controllers/application_controller.rb

    def logged_user
      @logged_user = User.find_or_create_by(ip_address: request.remote_ip)
---
INSERT INTO "users" ("ip_address", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["ip_address", "::1"], ["created_at", "2023-04-11 13:25:54.183521"], ["updated_at", "2023-04-11 13:25:54.183521"]]
SELECT "users".* FROM "users" WHERE "users"."ip_address" = $1 LIMIT $2  [["ip_address", "::1"], ["LIMIT", 1]]