app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" LIMIT $1  [["LIMIT", 20]]
---
    def index
      if query_param.present?
        save_search if valid_search_request?

        @articles = Article.search_by_title(query_param).limit(50)
      else
        @articles = Article.limit(20)