app/controllers/articles_controller.rb

    def index
      if params[:query].present?
        save_query(params[:query])
        @articles = Article.search_by_title(params[:query]).limit(50)
---
SELECT "articles".* FROM "articles" WHERE (title ILIKE '%Green%') LIMIT $1  [["LIMIT", 50]]

    def save_query(query)
      recent_query = @logged_user.searches.order(created_at: :desc).first
      return unless should_save_search_query?(query, recent_query)

      if recent_query.nil?
        Search.create(query: query, user: @logged_user)
      else
        recent_query.update(query: query)
---
SELECT "searches".* FROM "searches" WHERE "searches"."user_id" = $1 ORDER BY "searches"."created_at" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "searches" ("query", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["query", "My name"], ["user_id", 1], ["created_at", "2023-04-11 13:36:05.704723"], ["updated_at", "2023-04-11 13:36:05.704723"]]
UPDATE "searches" SET "query" = $1, "updated_at" = $2 WHERE "searches"."id" = $3  [["query", "My name is"], ["updated_at", "2023-04-11 13:38:27.152628"], ["id", 1]]