app/models/search.rb

SELECT "searches".* FROM "searches" WHERE "searches"."user_id" = $1 ORDER BY "searches"."created_at" DESC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
  scope :in_descending_order_by, -> (user) { where(user: user).order(created_at: :desc) }